package com.naver.erp;
import java.util.*;

//+++++++++++++++++++++++++++++++++++++++++++++++++++
// [QstnService 인터페이스] 선언
//+++++++++++++++++++++++++++++++++++++++++++++++++++
public interface QstnService {
   //*************************************************
   // [검색한 게시판 목록] 리턴하는 메소드 선언
   //*************************************************
   List<Map<String,String>> getQstn(QstnSearchDTO qstnSearchDTO);
   //*************************************************
   // [검색한 게시판 목록 개수] 리턴하는 메소드 선언
   //*************************************************
   int getQstnAllCnt (QstnSearchDTO qstnSearchDTO);
   
   public String writer(QstnDTO qstnDTO);
   
   //***************************************************************
   // [게시판 글 입력 후 입력 적용 행의 개수] 리턴하는 메소드 선언 
   //***************************************************************
   public int insertQstn (QstnDTO qstnDTO);
   //***************************************************************
   // [1개의 게시판 글] 리턴하는 메소드 선언 
   //***************************************************************
   QstnDTO getQstnDTO(int qna_no);
   //***************************************************************
   // 조회수 증가 없이 [1개 게시판 글] 리턴하는 메소드 선언
   //***************************************************************
   QstnDTO getQstnDTO_without_upReadcount(int qna_no_);
   //***************************************************************
   // [1개 게시판 글] 수정 후 수정 적용행의 개수를 리턴하는 메소드 선언
   //***************************************************************
   int updateQstn(QstnDTO qstnDTO);
   //***************************************************************
   // [1개 게시판 글] 삭제 후 삭제 적용행의 개수를 리턴하는 메소드 선언
   //***************************************************************
   int deleteQstn(QstnDTO qstnDTO);
   //***************************************************************
   // 관리자 계정의 개수 리턴하는 메소드 선언
   //***************************************************************
   public int masterQstn(QstnDTO qstnDTO);
   //***************************************************************

   // 로그인한 아이디가 관리자인지
   //***************************************************************
   public String getUserMaster(String user_id);
   //***************************************************************

   
///////////////////////////////////성유진////////////////////////////////////////////

   //*************************************************
   // 내가쓴글 목록 불러오기
   //*************************************************
   List<Map<String,String>> getMyQstnList(MyQstnSearchDTO myQstnSearchDTO);
   //*************************************************
   // 내가쓴글 목록 개수 불러오기
   //*************************************************
   int getMyQstnAllCnt (MyQstnSearchDTO myQstnSearchDTO);
   
   
   ///////////////////////////////////성유진////////////////////////////////////////////
   //*************************************************
   // 내가쓴글 목록 및 댓글 불러오기
   //*************************************************
   List<Map<String,String>> getMyQstnList2(MyQstnSearchDTO myQstnSearchDTO);
   //*************************************************
   // 내가쓴글 목록 개수 불러오기
   //*************************************************
   int getMyQstnAllCnt2 (MyQstnSearchDTO myQstnSearchDTO);
   ////성유진끝

   
   ///-----------------------------------------------최수현/////////////////////////////////
   // 내가 로그인한 정보의 group_no 가져오기
    //-----------------------------------------
   List<Map<String,String>> getQstnGroupNo(String user_id);
   
   
   
   
}   
