package com.naver.erp;

import java.util.List;
import java.util.Map;

//+++++++++++++++++++++++++++++++++++++++++++++++++++
// [DAO 인터페이스] 선언
//+++++++++++++++++++++++++++++++++++++++++++++++++++
public interface QstnDAO {
   //*************************************************
   // [검색한 게시판 목록] 리턴하는 메소드 선언
   //*************************************************
   List<Map<String,String>> getQstn(QstnSearchDTO qstnSearchDTO);
   //*************************************************
   // [검색한 게시판 목록 개수] 리턴하는 메소드 선언
   //*************************************************
   int getQstnAllCnt (QstnSearchDTO qstnSearchDTO);

   String writer(QstnDTO qstnDTO);
   
   //***************************************************************
   // [게시판 글 입력 후 입력 적용 행의 개수] 리턴하는 메소드 선언 
   //***************************************************************
   public int insertQstn (QstnDTO qstnDTO);

   //***************************************************************
   // [관리자 계정 개수] 리턴하는 메소드 선언 
   //***************************************************************
   public int masterQstn (QstnDTO qstnDTO);
   

   // 로그인한 아이디가 관리자인지
   //***************************************************************
   public String getUserMaster(String user_id);
   //***************************************************************


   
   //***************************************************************
   // 조회수 증가하는 메소드 선언
   //***************************************************************
   int updateReadcount(int qna_no);
   //***************************************************************
   // [1개의 게시판 정보]를 리턴하는 메소드 선언
   //***************************************************************
   QstnDTO getQstnDTO(int qna_no);
   
   
   // 수정할 게시판의 존재 개수를 리턴하는 메소드 선언
   int updateQstn(QstnDTO qstnDTO);
   // 삭제할 게시판의 존재 개수를 리턴하는 메소드 선언
   int getQstnCnt(QstnDTO qstnDTO);
   // 삭제할 게시판의 비밀번호 존재 개수를 리턴하는 메소드 선언
   int getPwdCnt(QstnDTO qstnDTO);
   // 삭제할 게시판의 아들 글 존재 개수를 리턴하는 메소드 선언
   int getSonCnt(QstnDTO qstnDTO);
   // 삭제될 게시판 이후 글의 출력 순서번호를 1씩 감소시킨 후 수정 적용행의 개수를 리턴하는 메소드
   int downPrintNo(QstnDTO qstnDTO);
   // 게시판 삭제 명령한 후 삭제 적용행의 개수를 리턴하는 메소드 선언
   int deleteQstn(QstnDTO qstnDTO);
   
   //**********************************************************************
   // [1개 게시판 글 출력번호 수정하고 수정행의 개수] 리턴하는 메소드 선언
   //**********************************************************************
   int updatePrintNo(QstnDTO qstnDTO);
   
   //----------------------------------성유진---------------------------------------
      //*************************************************
      // 내가쓴글 목록 불러오기 
      //*************************************************
      List<Map<String,String>> getMyQstnList(MyQstnSearchDTO myQstnSearchDTO);
      //*************************************************
      // 내가쓴글 목록 개수 불러오기
      //*************************************************
      int getMyQstnAllCnt (MyQstnSearchDTO myQstnSearchDTO);
      
      
      // 성유진 
      //*************************************************
      // 내가쓴글 및 답글 목록 불러오기 
      //*************************************************
      List<Map<String,String>> getMyQstnList2(MyQstnSearchDTO myQstnSearchDTO);
      //*************************************************
      // 내가쓴글 및 답글 목록 개수 불러오기
      //*************************************************
      int getMyQstnAllCnt2 (MyQstnSearchDTO myQstnSearchDTO);
      
      // 성유진 끝
      
      

      ///-----------------------------------------------최수현/////////////////////////////////
      // 내가 로그인한 정보의 group_no 가져오기
      //-----------------------------------------
      List<Map<String,String>> getQstnGroupNo(String user_id);
   
}
   